// data.js

export const tableData = [
    { news: 'New York' },
    { news: 'Los Angeles' },
    { news: 'Chicago' },
    { news: 'Chicago' },
    { news: 'Chicago' },
    { news: 'Chicago' },
    { news: 'Chicago' },
    { news: 'Chicago' }
];

export const NewsData = [
    { 标题: '海军第43批护航编队完成任务返回湛江', 链接: 'https://mil.huanqiu.com/article/4EKhMxF4kEr', 来源: '中国军网', 内容: '解放军报湛江8月29日电 唐思宇、吴亢慈报道：中国海军第43批护航编队在圆满完成护航、联演、撤离我在苏丹人员和访问任务后，于29日顺利返回广东湛江某军港。第43批护航编队历时232天，累计航行近12万海里，顺利完成了护航任务，有力维护了国际海上贸易通道安全和地区和平稳定。任务期间，南宁舰先后赴巴基斯坦卡拉奇、阿联酋阿布扎比、伊朗恰巴哈尔参加了“和平-23”多国海上联演、阿布扎比国际海事防务展和“安全纽带-2023”海上联演，进一步加深了中国与巴基斯坦、阿联酋、伊朗的传统友谊，充分展现了中国海军开放自信的良好形象。4月下旬，南宁舰、微山湖舰昼夜兼程、千里驰援，执行撤离我在苏丹人员任务。此外，护航编队还先后访问了科特迪瓦、加纳、尼日利亚、加蓬、刚果（布），与西非五国海军进行深入友好交流，进一步深化了中非政治、军事互信，增进了中非传统情谊。'},
    { 标题: 'Los 苹果明确：欧盟用户离境后第三方应用商店访问权限保留30天', 链接: 'https://tech.huanqiu.com/article/4GtyoVoiqfY', 来源: '环球网', 内容: '【环球网科技综合报道】近日，苹果公司针对欧盟用户发布了一项新规定，明确了用户在离开欧盟后，对第三方应用商店的访问权限将保留30天的时间。这一举措对于已经侧载应用并计划离开欧盟的用户来说具有重要意义。根据苹果更新的支持页面，用户在离开欧盟后的30天内，仍然可以继续从第三方应用商店下载新的应用，并接收已下载应用的更新。然而，一旦超过这个宽限期，用户将失去从这些替代应用商店下载新应用或获取应用更新的能力。尽管如此，用户在欧盟以外地区仍可以无限期地使用已经安装的第三方应用，但需要注意的是，在30天宽限期结束后，这些应用将无法再获得软件更新。此外，苹果还针对一种特殊情况做出了说明。如果用户在离开欧盟满30天后再次返回欧盟境内，他们将重新获得从第三方应用商店下载应用并接收更新的权限。然而，需要特别注意的是，要使用iOS 17.4新推出的应用侧载功能，用户必须身处欧盟27个成员国或其海外领土之一。这项新规定的出台，是苹果公司对欧盟《数字市场法案》的进一步响应。该法案旨在遏制大型网络平台的恶性竞争行为，保障消费者的多元化选择权。苹果公司作为受影响最大的企业之一，不得不调整其长期以来封闭的生态系统策略，以适应欧盟的法规要求。' },
    { 标题: '俄罗斯外交部：从武装叛乱中获利的是俄外部敌人', 链接: 'https://mil.huanqiu.com/article/4DRZiAUgBQX', 来源: '央视新闻客户端', 内容: '俄罗斯外交部当地时间24日发表声明称，在俄罗斯搞武装叛乱的企图引起俄罗斯社会强烈反感，俄罗斯社会坚定支持俄总统普京。阴谋者的冒险企图是为了破坏俄罗斯局势稳定，破坏俄罗斯国内团结，破坏俄罗斯为确保国际安全所作的努力。从武装叛乱中获利的是俄罗斯的外部敌人。声明警告西方国家不要做出任何可能利用俄罗斯国内局势来实现其“恐俄”目标的暗示。声明强调，俄罗斯将继续走自己的主权路线，以确保自身安全，保护自身持有的价值观，并致力于建立公平的多极世界秩序。（总台记者 宋瑶）' },
];

export const inferenceResultsData = [
    { 标题: '海军第43批护航编队完成任务返回湛江',来源: '中国军网', 内容: '解放军报湛江8月29日电 唐思宇、吴亢慈报道：中国海军第43批护航编队在圆满完成护航、联演、撤离我在苏丹人员和访问任务后，于29日顺利返回广东湛江某军港。第43批护航编队历时232天，累计航行近12万海里，顺利完成了护航任务，有力维护了国际海上贸易通道安全和地区和平稳定。任务期间，南宁舰先后赴巴基斯坦卡拉奇、阿联酋阿布扎比、伊朗恰巴哈尔参加了“和平-23”多国海上联演、阿布扎比国际海事防务展和“安全纽带-2023”海上联演，进一步加深了中国与巴基斯坦、阿联酋、伊朗的传统友谊，充分展现了中国海军开放自信的良好形象。4月下旬，南宁舰、微山湖舰昼夜兼程、千里驰援，执行撤离我在苏丹人员任务。此外，护航编队还先后访问了科特迪瓦、加纳、尼日利亚、加蓬、刚果（布），与西非五国海军进行深入友好交流，进一步深化了中非政治、军事互信，增进了中非传统情谊。', 类别: '军事', 概率值:'0.19030033802261434'},
    { 标题: 'Los 苹果明确：欧盟用户离境后第三方应用商店访问权限保留30天', 来源: '环球网', 内容: '【环球网科技综合报道】近日，苹果公司针对欧盟用户发布了一项新规定，明确了用户在离开欧盟后，对第三方应用商店的访问权限将保留30天的时间。这一举措对于已经侧载应用并计划离开欧盟的用户来说具有重要意义。根据苹果更新的支持页面，用户在离开欧盟后的30天内，仍然可以继续从第三方应用商店下载新的应用，并接收已下载应用的更新。然而，一旦超过这个宽限期，用户将失去从这些替代应用商店下载新应用或获取应用更新的能力。尽管如此，用户在欧盟以外地区仍可以无限期地使用已经安装的第三方应用，但需要注意的是，在30天宽限期结束后，这些应用将无法再获得软件更新。此外，苹果还针对一种特殊情况做出了说明。如果用户在离开欧盟满30天后再次返回欧盟境内，他们将重新获得从第三方应用商店下载应用并接收更新的权限。然而，需要特别注意的是，要使用iOS 17.4新推出的应用侧载功能，用户必须身处欧盟27个成员国或其海外领土之一。这项新规定的出台，是苹果公司对欧盟《数字市场法案》的进一步响应。该法案旨在遏制大型网络平台的恶性竞争行为，保障消费者的多元化选择权。苹果公司作为受影响最大的企业之一，不得不调整其长期以来封闭的生态系统策略，以适应欧盟的法规要求。', 类别: '非军事', 概率值:'0.678651293376241' },
    { 标题: '俄罗斯外交部：从武装叛乱中获利的是俄外部敌人', 来源: '央视新闻客户端', 内容: '俄罗斯外交部当地时间24日发表声明称，在俄罗斯搞武装叛乱的企图引起俄罗斯社会强烈反感，俄罗斯社会坚定支持俄总统普京。阴谋者的冒险企图是为了破坏俄罗斯局势稳定，破坏俄罗斯国内团结，破坏俄罗斯为确保国际安全所作的努力。从武装叛乱中获利的是俄罗斯的外部敌人。声明警告西方国家不要做出任何可能利用俄罗斯国内局势来实现其“恐俄”目标的暗示。声明强调，俄罗斯将继续走自己的主权路线，以确保自身安全，保护自身持有的价值观，并致力于建立公平的多极世界秩序。（总台记者 宋瑶）', 类别: '非军事', 概率值: '0.8326479347465844'},
];

export const chartDatas= [
    {
        // 图表的标题
        title: {
            text: '柱状图示例1'
        },
        // 图表的提示框组件
        tooltip: {
            trigger: 'axis'
        },
        // 图表的 x 轴配置
        xAxis: {
            type: 'category',
            data: ['周一', '周二', '周三', '周四', '周五', '周六', '周日']
        },
        // 图表的 y 轴配置
        yAxis: {
            type: 'value'
        },
        // 图表的系列配置，这里是柱状图
        series: [
            {
                name: '销量',
                type: 'bar',
                data: [120, 200, 150, 80, 70, 110, 130]
            }
        ]
    },
    {
        // 图表的标题
        title: {
            text: '柱状图示例2'
        },
        // 图表的提示框组件
        tooltip: {
            trigger: 'axis'
        },
        // 图表的 x 轴配置
        xAxis: {
            type: 'category',
            data: ['周一', '周二', '周三', '周四', '周五', '周六', '周日']
        },
        // 图表的 y 轴配置
        yAxis: {
            type: 'value'
        },
        // 图表的系列配置，这里是柱状图
        series: [
            {
                name: '销量',
                type: 'bar',
                data: [120, 200, 150, 80, 70, 110, 130]
            }
        ]
    }
    // 可以继续添加更多的图表数据
]