// data.js

export const NewsData = [
    { 链接: 'https://mil.huanqiu.com/article/4EKhMxF4kEr', 来源: '中国军网', 内容: '解放军报湛江8月29日电 唐思宇、吴亢慈报道：中国海军第43批护航编队在圆满完成护航、联演、撤离我在苏丹人员和访问任务后，于29日顺利返回广东湛江某军港。第43批护航编队历时232天，累计航行近12万海里，顺利完成了护航任务，有力维护了国际海上贸易通道安全和地区和平稳定。任务期间，南宁舰先后赴巴基斯坦卡拉奇、阿联酋阿布扎比、伊朗恰巴哈尔参加了“和平-23”多国海上联演、阿布扎比国际海事防务展和“安全纽带-2023”海上联演，进一步加深了中国与巴基斯坦、阿联酋、伊朗的传统友谊，充分展现了中国海军开放自信的良好形象。4月下旬，南宁舰、微山湖舰昼夜兼程、千里驰援，执行撤离我在苏丹人员任务。此外，护航编队还先后访问了科特迪瓦、加纳、尼日利亚、加蓬、刚果（布），与西非五国海军进行深入友好交流，进一步深化了中非政治、军事互信，增进了中非传统情谊。'},
    { 链接: 'https://tech.huanqiu.com/article/4GtyoVoiqfY', 来源: '环球网', 内容: '【环球网科技综合报道】近日，苹果公司针对欧盟用户发布了一项新规定，明确了用户在离开欧盟后，对第三方应用商店的访问权限将保留30天的时间。这一举措对于已经侧载应用并计划离开欧盟的用户来说具有重要意义。根据苹果更新的支持页面，用户在离开欧盟后的30天内，仍然可以继续从第三方应用商店下载新的应用，并接收已下载应用的更新。然而，一旦超过这个宽限期，用户将失去从这些替代应用商店下载新应用或获取应用更新的能力。尽管如此，用户在欧盟以外地区仍可以无限期地使用已经安装的第三方应用，但需要注意的是，在30天宽限期结束后，这些应用将无法再获得软件更新。此外，苹果还针对一种特殊情况做出了说明。如果用户在离开欧盟满30天后再次返回欧盟境内，他们将重新获得从第三方应用商店下载应用并接收更新的权限。然而，需要特别注意的是，要使用iOS 17.4新推出的应用侧载功能，用户必须身处欧盟27个成员国或其海外领土之一。这项新规定的出台，是苹果公司对欧盟《数字市场法案》的进一步响应。该法案旨在遏制大型网络平台的恶性竞争行为，保障消费者的多元化选择权。苹果公司作为受影响最大的企业之一，不得不调整其长期以来封闭的生态系统策略，以适应欧盟的法规要求。' },
    { 链接: 'https://mil.huanqiu.com/article/4DRZiAUgBQX', 来源: '央视新闻客户端', 内容: '俄罗斯外交部当地时间24日发表声明称，在俄罗斯搞武装叛乱的企图引起俄罗斯社会强烈反感，俄罗斯社会坚定支持俄总统普京。阴谋者的冒险企图是为了破坏俄罗斯局势稳定，破坏俄罗斯国内团结，破坏俄罗斯为确保国际安全所作的努力。从武装叛乱中获利的是俄罗斯的外部敌人。声明警告西方国家不要做出任何可能利用俄罗斯国内局势来实现其“恐俄”目标的暗示。声明强调，俄罗斯将继续走自己的主权路线，以确保自身安全，保护自身持有的价值观，并致力于建立公平的多极世界秩序。（总台记者 宋瑶）' },
    { 链接: 'https://mil.huanqiu.com/article/4DVoiqUgBQX', 来源: '央视新闻客户端', 内容: '针对美国将向乌提供31辆主战坦克、德国决定向乌克兰提供主战坦克，俄罗斯总统新闻秘书佩斯科夫25日说，美德向乌克兰提供主战坦克是“荒谬的主意”。俄驻德大使涅恰耶夫表示，这将进一步加剧俄乌冲突，并与德国领导人关于德国不想卷入冲突的声明矛盾。（总台记者宋瑶 余鹏）', 摘要: '俄方回应美德向乌提供主战坦克：是“荒谬的主意'},
    { 链接: 'https://mil.huanqiu.com/article/4DiqUgUgBQX', 来源: '央视新闻客户端', 内容: '中新网1月4日电 据俄罗斯卫星通讯社报道，俄罗斯武装力量军事政治总局第一副局长谢尔盖·谢夫留科夫中将称，在清理废墟之后，乌克兰军队袭击马克耶夫卡造成的俄军死亡人数升至89人，其中包括一名副团长。 据报道，谢夫留科夫称，1月1日跨年夜，乌克兰炮兵向俄军在马克耶夫卡地区的一个临时部署点发射了6枚“海马斯”火箭弹，其中两枚被防空系统拦截，4枚装有杀伤爆破弹头的火箭弹击中俄罗斯军人所在的建筑物。 谢夫留科夫表示，“悲剧发生后，该部队的指挥人员和军官、初级指战员和其他部队的军人立即采取了一切可用的措施抢救伤员。他们进行了急救，将伤员送到医疗机构。不幸的是，在清除钢混废墟的过程中，俄军死亡人数上升至89人，包括副团长巴丘林中校。” 谢夫留科夫补充说，当前正在向所有伤亡军人家属提供一切必要的帮助和支持。 此前俄罗斯国防部称，在跨年夜，乌克兰武装力量对顿涅茨克马克耶夫卡地区的俄罗斯军人临时部署点进行了打击，导致63人死亡。 据法新社报道，基辅2日宣布对俄罗斯军队在乌克兰东部遭受致命袭击负责。乌克兰武装部队总参谋部在一份声明中称，“(2022年)12月31日，在顿涅茨克东部地区的马克耶夫卡，多达10套敌方各种类型的军事装备被摧毁和损坏。”', 摘要: '乌克兰军队袭击马克耶夫卡造成的俄军死亡人数升至89人'},
    { 链接: 'https://mil.huanqiu.com/article/4DRZiAUgBQX', 来源: '央视新闻客户端', 内容: '当地时间11月4日，以色列国防军发表声明称，当天凌晨，以军空袭了巴勒斯坦加沙地带中部一处隶属于巴勒斯坦伊斯兰抵抗运动组织（哈马斯）的军事设施，该军事设施位于地下，主要用于火箭弹的研发和生产。此次空袭主要是对稍早前以色列遭到火箭弹袭击进行报复。以色列国防军表示，当地时间3日晚间，加沙地带武装组织先后向以色列境内发射了4枚火箭弹，3枚落在无人区，1枚被以色列“铁穹”防御系统拦截，未造成人员伤亡。这是自今年8月8日以色列同巴勒斯坦伊斯兰圣战组织（杰哈德）结束冲突以来，加沙地带再度向以境内发射火箭弹。根据以色列当地媒体报道，此次火箭弹袭击仍是杰哈德所为，是报复以军在3日打死一位杰哈德在约旦河西岸城市杰宁的指挥官。不过，包括杰哈德在内的巴勒斯坦武装组织未公开确认此事。以军表示，无论哪个加沙地带武装组织对以色列发动袭击，控制加沙地带的哈马斯都要对此承担责任。（总台记者 赵兵）', 摘要:'以军空袭了巴勒斯坦加沙地带中部一处隶属于巴勒斯坦伊斯兰抵抗运动组织（哈马斯）的军事设施'},

];

export const task1Data = [
    { 内容: '解放军报湛江8月29日电 唐思宇、吴亢慈报道：中国海军第43批护航编队在圆满完成护航、联演、撤离我在苏丹人员和访问任务后，于29日顺利返回广东湛江某军港。第43批护航编队历时232天，累计航行近12万海里，顺利完成了护航任务，有力维护了国际海上贸易通道安全和地区和平稳定。任务期间，南宁舰先后赴巴基斯坦卡拉奇、阿联酋阿布扎比、伊朗恰巴哈尔参加了“和平-23”多国海上联演、阿布扎比国际海事防务展和“安全纽带-2023”海上联演，进一步加深了中国与巴基斯坦、阿联酋、伊朗的传统友谊，充分展现了中国海军开放自信的良好形象。4月下旬，南宁舰、微山湖舰昼夜兼程、千里驰援，执行撤离我在苏丹人员任务。此外，护航编队还先后访问了科特迪瓦、加纳、尼日利亚、加蓬、刚果（布），与西非五国海军进行深入友好交流，进一步深化了中非政治、军事互信，增进了中非传统情谊。', 类别: '军事', 概率值:'0.19030033802261434'},
    { 内容: '俄罗斯外交部当地时间24日发表声明称，在俄罗斯搞武装叛乱的企图引起俄罗斯社会强烈反感，俄罗斯社会坚定支持俄总统普京。阴谋者的冒险企图是为了破坏俄罗斯局势稳定，破坏俄罗斯国内团结，破坏俄罗斯为确保国际安全所作的努力。从武装叛乱中获利的是俄罗斯的外部敌人。声明警告西方国家不要做出任何可能利用俄罗斯国内局势来实现其“恐俄”目标的暗示。声明强调，俄罗斯将继续走自己的主权路线，以确保自身安全，保护自身持有的价值观，并致力于建立公平的多极世界秩序。（总台记者 宋瑶）', 类别: '军事', 概率值: '0.22101294831696694'},
    { 内容: '针对美国将向乌提供31辆主战坦克、德国决定向乌克兰提供主战坦克，俄罗斯总统新闻秘书佩斯科夫25日说，美德向乌克兰提供主战坦克是“荒谬的主意”。俄驻德大使涅恰耶夫表示，这将进一步加剧俄乌冲突，并与德国领导人关于德国不想卷入冲突的声明矛盾。（总台记者宋瑶 余鹏）',类别: '军事', 概率值:'0.16030033802261434' },
    { 内容: '中新网1月4日电 据俄罗斯卫星通讯社报道，俄罗斯武装力量军事政治总局第一副局长谢尔盖·谢夫留科夫中将称，在清理废墟之后，乌克兰军队袭击马克耶夫卡造成的俄军死亡人数升至89人，其中包括一名副团长。 据报道，谢夫留科夫称，1月1日跨年夜，乌克兰炮兵向俄军在马克耶夫卡地区的一个临时部署点发射了6枚“海马斯”火箭弹，其中两枚被防空系统拦截，4枚装有杀伤爆破弹头的火箭弹击中俄罗斯军人所在的建筑物。 谢夫留科夫表示，“悲剧发生后，该部队的指挥人员和军官、初级指战员和其他部队的军人立即采取了一切可用的措施抢救伤员。他们进行了急救，将伤员送到医疗机构。不幸的是，在清除钢混废墟的过程中，俄军死亡人数上升至89人，包括副团长巴丘林中校。” 谢夫留科夫补充说，当前正在向所有伤亡军人家属提供一切必要的帮助和支持。 此前俄罗斯国防部称，在跨年夜，乌克兰武装力量对顿涅茨克马克耶夫卡地区的俄罗斯军人临时部署点进行了打击，导致63人死亡。 据法新社报道，基辅2日宣布对俄罗斯军队在乌克兰东部遭受致命袭击负责。乌克兰武装部队总参谋部在一份声明中称，“(2022年)12月31日，在顿涅茨克东部地区的马克耶夫卡，多达10套敌方各种类型的军事装备被摧毁和损坏。”',类别: '军事', 概率值:'0.18030033802261434'},
    { 内容: '当地时间11月4日，以色列国防军发表声明称，当天凌晨，以军空袭了巴勒斯坦加沙地带中部一处隶属于巴勒斯坦伊斯兰抵抗运动组织（哈马斯）的军事设施，该军事设施位于地下，主要用于火箭弹的研发和生产。此次空袭主要是对稍早前以色列遭到火箭弹袭击进行报复。以色列国防军表示，当地时间3日晚间，加沙地带武装组织先后向以色列境内发射了4枚火箭弹，3枚落在无人区，1枚被以色列“铁穹”防御系统拦截，未造成人员伤亡。这是自今年8月8日以色列同巴勒斯坦伊斯兰圣战组织（杰哈德）结束冲突以来，加沙地带再度向以境内发射火箭弹。根据以色列当地媒体报道，此次火箭弹袭击仍是杰哈德所为，是报复以军在3日打死一位杰哈德在约旦河西岸城市杰宁的指挥官。不过，包括杰哈德在内的巴勒斯坦武装组织未公开确认此事。以军表示，无论哪个加沙地带武装组织对以色列发动袭击，控制加沙地带的哈马斯都要对此承担责任。（总台记者 赵兵）',类别: '军事', 概率值:'0.23030033802261434'},

];

export const task2Data = [
    { 内容: '针对美国将向乌提供31辆主战坦克、德国决定向乌克兰提供主战坦克，俄罗斯总统新闻秘书佩斯科夫25日说，美德向乌克兰提供主战坦克是“荒谬的主意”。俄驻德大使涅恰耶夫表示，这将进一步加剧俄乌冲突，并与德国领导人关于德国不想卷入冲突的声明矛盾。（总台记者宋瑶 余鹏）' },
    { 内容: '中新网1月4日电 据俄罗斯卫星通讯社报道，俄罗斯武装力量军事政治总局第一副局长谢尔盖·谢夫留科夫中将称，在清理废墟之后，乌克兰军队袭击马克耶夫卡造成的俄军死亡人数升至89人，其中包括一名副团长。 据报道，谢夫留科夫称，1月1日跨年夜，乌克兰炮兵向俄军在马克耶夫卡地区的一个临时部署点发射了6枚“海马斯”火箭弹，其中两枚被防空系统拦截，4枚装有杀伤爆破弹头的火箭弹击中俄罗斯军人所在的建筑物。 谢夫留科夫表示，“悲剧发生后，该部队的指挥人员和军官、初级指战员和其他部队的军人立即采取了一切可用的措施抢救伤员。他们进行了急救，将伤员送到医疗机构。不幸的是，在清除钢混废墟的过程中，俄军死亡人数上升至89人，包括副团长巴丘林中校。” 谢夫留科夫补充说，当前正在向所有伤亡军人家属提供一切必要的帮助和支持。 此前俄罗斯国防部称，在跨年夜，乌克兰武装力量对顿涅茨克马克耶夫卡地区的俄罗斯军人临时部署点进行了打击，导致63人死亡。 据法新社报道，基辅2日宣布对俄罗斯军队在乌克兰东部遭受致命袭击负责。乌克兰武装部队总参谋部在一份声明中称，“(2022年)12月31日，在顿涅茨克东部地区的马克耶夫卡，多达10套敌方各种类型的军事装备被摧毁和损坏。”'},
    { 内容: '当地时间11月4日，以色列国防军发表声明称，当天凌晨，以军空袭了巴勒斯坦加沙地带中部一处隶属于巴勒斯坦伊斯兰抵抗运动组织（哈马斯）的军事设施，该军事设施位于地下，主要用于火箭弹的研发和生产。此次空袭主要是对稍早前以色列遭到火箭弹袭击进行报复。以色列国防军表示，当地时间3日晚间，加沙地带武装组织先后向以色列境内发射了4枚火箭弹，3枚落在无人区，1枚被以色列“铁穹”防御系统拦截，未造成人员伤亡。这是自今年8月8日以色列同巴勒斯坦伊斯兰圣战组织（杰哈德）结束冲突以来，加沙地带再度向以境内发射火箭弹。根据以色列当地媒体报道，此次火箭弹袭击仍是杰哈德所为，是报复以军在3日打死一位杰哈德在约旦河西岸城市杰宁的指挥官。不过，包括杰哈德在内的巴勒斯坦武装组织未公开确认此事。以军表示，无论哪个加沙地带武装组织对以色列发动袭击，控制加沙地带的哈马斯都要对此承担责任。（总台记者 赵兵）'},
    { 内容: '据西班牙媒体《20分钟》报道，当地时间24日，美国副总统卡玛拉·哈里斯警告以色列称，如果以色列不听劝告攻击拉法，后果将不堪设想。报道称，在针对是否进攻拉法的问题上，美以近期分歧不断。此前美国就警告以色列，不要地面入侵人口众多的拉法地区，否则将加深加沙地带的人道主义危机，在20日，以色列总理内塔尼亚胡拒绝了美国总统拜登要求取消以军对拉法地面攻击计划的请求。内塔尼亚胡当时称，他已经“非常明确地”向美国总统拜登表示，“我们决心彻底消灭拉法的这些武装分子，除了地面进攻行动外，别无他法。”当地时间24日，美国副总统卡玛拉·哈里斯再次警告以色列，如果以色列选择攻击位于加沙地带南端的拉法，将会产生严重后果。“我们在和以色列的多次对话中，以及众多其他场合都讲得很清楚，针对拉法的任何重大军事行动都将是一个巨大错误，”哈里斯在接受美国广播公司采访时说。当记者追问美国是否会因拉法地区遇袭而让以色列承担后果的时候，哈里斯直截了当地回答说：“我不排除任何可能性。”当地时间22日，美国国务卿安东尼·布林肯降落在特拉维夫附近的机场，布林肯希望可以立即停火，以释放仍被哈马斯俘虏的134名人质，缓解加沙地带的局势，并希望避免或推迟在拉法地区的地面进攻，显然，在拉法问题上，这已成为美以两国之间的重大分歧。据法国24电视台报道，法国总统马克龙在当地时间24日也分别同以色列总理内塔尼亚胡和约旦国王阿卜杜拉二世通电话，表示法国“坚决反对”以色列进攻加沙地带南部城市拉法的立场，并警告说如果以色列“不听劝阻强制迁移人口将构成战争罪。'},
    { 内容: '以色列国防军当地时间18日下午发表声明称，以军和以色列国家安全总局（辛贝特）仍继续在加沙地带北部的希法医院展开对巴勒斯坦伊斯兰抵抗运动（哈马斯）的打击。截至目前，以军已经在希法医院的交火中打死20名武装人员，并正在审问逮捕的数十人。以军表示，在希法医院内还发现了哈马斯的大量现金和武器。这再一次证明，哈马斯有计划地利用医院和平民设施来为其军事活动服务。对于上述说法，哈马斯方面暂无回应。（总台记者 魏然）' },
    { 内容: '当地时间17日，以色列总理内塔尼亚胡称，即使有再多的国际压力，也无法阻止以色列在加沙地带实现军事行动的所有目标，以色列国防军将按计划对加沙地带南部城市拉法发动地面进攻。以色列总理内塔尼亚胡17日在内阁会议上称，再多的国际压力也无法阻止以色列在加沙地带实现军事行动的所有目标——以军将消灭巴勒斯坦伊斯兰抵抗运动（哈马斯），解救所有被扣押人员，并确保加沙地带不再对以色列构成威胁；而为实现这一目标，以军将按计划对拉法发动地面进攻。内塔尼亚胡还指责一些国家和个人对以色列“进行了错误的指控”，试图在以色列“达成既定目标前阻止战争”。他表示，如果现在停止军事行动，那么就意味着以色列输掉了战争，他“不会允许这种情况出现”。拉法位于加沙地带最南端、与埃及接壤，是国际人道援助物资进入加沙地带的门户。自去年10月新一轮巴以冲突爆发以来，以军在加沙地带由北向南发动地面攻势，目前有约150万左右的巴勒斯坦平民在拉法避难。巴总统府呼吁国际社会阻止以军行动对于以军将在拉法发动地面进攻的计划，巴勒斯坦总统府此前发表声明，呼吁国际社会迅速干预并承担起责任，防止以色列对拉法“危险的侵略”，并表示这种侵略使加沙地带人民的痛苦加倍。声明重申巴方拒绝任何迫使加沙民众流离失所的做法，并表示“这是一条红线”。'},
    { 内容: '乌克兰国家通讯社3月17日引述乌国内消息人士的话称，乌克兰国家安全局联合乌克兰武装部队特种作战部队、乌无人作战系统部队，使用无人机对俄罗斯克拉斯诺达尔边疆区的斯拉维扬斯克炼油厂实施了打击。报道还称，乌克兰无人机已成功对俄罗斯12家炼油厂实施了打击。（总台记者 王晋燕）' },
];

export const task3Data = [
    { 内容: '针对美国将向乌提供31辆主战坦克、德国决定向乌克兰提供主战坦克，俄罗斯总统新闻秘书佩斯科夫25日说，美德向乌克兰提供主战坦克是“荒谬的主意”。俄驻德大使涅恰耶夫表示，这将进一步加剧俄乌冲突，并与德国领导人关于德国不想卷入冲突的声明矛盾。（总台记者宋瑶 余鹏）', 摘要: '俄方回应美德向乌提供主战坦克：是“荒谬的主意'},
    { 内容: '中新网1月4日电 据俄罗斯卫星通讯社报道，俄罗斯武装力量军事政治总局第一副局长谢尔盖·谢夫留科夫中将称，在清理废墟之后，乌克兰军队袭击马克耶夫卡造成的俄军死亡人数升至89人，其中包括一名副团长。 据报道，谢夫留科夫称，1月1日跨年夜，乌克兰炮兵向俄军在马克耶夫卡地区的一个临时部署点发射了6枚“海马斯”火箭弹，其中两枚被防空系统拦截，4枚装有杀伤爆破弹头的火箭弹击中俄罗斯军人所在的建筑物。 谢夫留科夫表示，“悲剧发生后，该部队的指挥人员和军官、初级指战员和其他部队的军人立即采取了一切可用的措施抢救伤员。他们进行了急救，将伤员送到医疗机构。不幸的是，在清除钢混废墟的过程中，俄军死亡人数上升至89人，包括副团长巴丘林中校。” 谢夫留科夫补充说，当前正在向所有伤亡军人家属提供一切必要的帮助和支持。 此前俄罗斯国防部称，在跨年夜，乌克兰武装力量对顿涅茨克马克耶夫卡地区的俄罗斯军人临时部署点进行了打击，导致63人死亡。 据法新社报道，基辅2日宣布对俄罗斯军队在乌克兰东部遭受致命袭击负责。乌克兰武装部队总参谋部在一份声明中称，“(2022年)12月31日，在顿涅茨克东部地区的马克耶夫卡，多达10套敌方各种类型的军事装备被摧毁和损坏。”', 摘要: '乌克兰军队袭击马克耶夫卡造成的俄军死亡人数升至89人'},
    { 内容: '当地时间11月4日，以色列国防军发表声明称，当天凌晨，以军空袭了巴勒斯坦加沙地带中部一处隶属于巴勒斯坦伊斯兰抵抗运动组织（哈马斯）的军事设施，该军事设施位于地下，主要用于火箭弹的研发和生产。此次空袭主要是对稍早前以色列遭到火箭弹袭击进行报复。以色列国防军表示，当地时间3日晚间，加沙地带武装组织先后向以色列境内发射了4枚火箭弹，3枚落在无人区，1枚被以色列“铁穹”防御系统拦截，未造成人员伤亡。这是自今年8月8日以色列同巴勒斯坦伊斯兰圣战组织（杰哈德）结束冲突以来，加沙地带再度向以境内发射火箭弹。根据以色列当地媒体报道，此次火箭弹袭击仍是杰哈德所为，是报复以军在3日打死一位杰哈德在约旦河西岸城市杰宁的指挥官。不过，包括杰哈德在内的巴勒斯坦武装组织未公开确认此事。以军表示，无论哪个加沙地带武装组织对以色列发动袭击，控制加沙地带的哈马斯都要对此承担责任。（总台记者 赵兵）', 摘要:'以军空袭了巴勒斯坦加沙地带中部一处隶属于巴勒斯坦伊斯兰抵抗运动组织（哈马斯）的军事设施'},
    { 内容: '据西班牙媒体《20分钟》报道，当地时间24日，美国副总统卡玛拉·哈里斯警告以色列称，如果以色列不听劝告攻击拉法，后果将不堪设想。报道称，在针对是否进攻拉法的问题上，美以近期分歧不断。此前美国就警告以色列，不要地面入侵人口众多的拉法地区，否则将加深加沙地带的人道主义危机，在20日，以色列总理内塔尼亚胡拒绝了美国总统拜登要求取消以军对拉法地面攻击计划的请求。内塔尼亚胡当时称，他已经“非常明确地”向美国总统拜登表示，“我们决心彻底消灭拉法的这些武装分子，除了地面进攻行动外，别无他法。”当地时间24日，美国副总统卡玛拉·哈里斯再次警告以色列，如果以色列选择攻击位于加沙地带南端的拉法，将会产生严重后果。“我们在和以色列的多次对话中，以及众多其他场合都讲得很清楚，针对拉法的任何重大军事行动都将是一个巨大错误，”哈里斯在接受美国广播公司采访时说。当记者追问美国是否会因拉法地区遇袭而让以色列承担后果的时候，哈里斯直截了当地回答说：“我不排除任何可能性。”当地时间22日，美国国务卿安东尼·布林肯降落在特拉维夫附近的机场，布林肯希望可以立即停火，以释放仍被哈马斯俘虏的134名人质，缓解加沙地带的局势，并希望避免或推迟在拉法地区的地面进攻，显然，在拉法问题上，这已成为美以两国之间的重大分歧。据法国24电视台报道，法国总统马克龙在当地时间24日也分别同以色列总理内塔尼亚胡和约旦国王阿卜杜拉二世通电话，表示法国“坚决反对”以色列进攻加沙地带南部城市拉法的立场，并警告说如果以色列“不听劝阻强制迁移人口将构成战争罪。',摘要:'美国副总统警告以色列：如不听劝告攻击拉法，后果不堪设想'  },
    { 内容: '以色列国防军当地时间18日下午发表声明称，以军和以色列国家安全总局（辛贝特）仍继续在加沙地带北部的希法医院展开对巴勒斯坦伊斯兰抵抗运动（哈马斯）的打击。截至目前，以军已经在希法医院的交火中打死20名武装人员，并正在审问逮捕的数十人。以军表示，在希法医院内还发现了哈马斯的大量现金和武器。这再一次证明，哈马斯有计划地利用医院和平民设施来为其军事活动服务。对于上述说法，哈马斯方面暂无回应。（总台记者 魏然）' , 摘要:'以军称在加沙地带希法医院打死20名哈马斯武装人员'},
    { 内容: '当地时间17日，以色列总理内塔尼亚胡称，即使有再多的国际压力，也无法阻止以色列在加沙地带实现军事行动的所有目标，以色列国防军将按计划对加沙地带南部城市拉法发动地面进攻。以色列总理内塔尼亚胡17日在内阁会议上称，再多的国际压力也无法阻止以色列在加沙地带实现军事行动的所有目标——以军将消灭巴勒斯坦伊斯兰抵抗运动（哈马斯），解救所有被扣押人员，并确保加沙地带不再对以色列构成威胁；而为实现这一目标，以军将按计划对拉法发动地面进攻。内塔尼亚胡还指责一些国家和个人对以色列“进行了错误的指控”，试图在以色列“达成既定目标前阻止战争”。他表示，如果现在停止军事行动，那么就意味着以色列输掉了战争，他“不会允许这种情况出现”。拉法位于加沙地带最南端、与埃及接壤，是国际人道援助物资进入加沙地带的门户。自去年10月新一轮巴以冲突爆发以来，以军在加沙地带由北向南发动地面攻势，目前有约150万左右的巴勒斯坦平民在拉法避难。巴总统府呼吁国际社会阻止以军行动对于以军将在拉法发动地面进攻的计划，巴勒斯坦总统府此前发表声明，呼吁国际社会迅速干预并承担起责任，防止以色列对拉法“危险的侵略”，并表示这种侵略使加沙地带人民的痛苦加倍。声明重申巴方拒绝任何迫使加沙民众流离失所的做法，并表示“这是一条红线”。',摘要:'以色列国防军将按计划对加沙地带南部城市拉法发动地面进攻' },
    { 内容: '乌克兰国家通讯社3月17日引述乌国内消息人士的话称，乌克兰国家安全局联合乌克兰武装部队特种作战部队、乌无人作战系统部队，使用无人机对俄罗斯克拉斯诺达尔边疆区的斯拉维扬斯克炼油厂实施了打击。报道还称，乌克兰无人机已成功对俄罗斯12家炼油厂实施了打击。（总台记者 王晋燕）' ,摘要:'乌方称对俄克拉斯诺达尔边疆区炼油厂实施无人机打击'},

];

export const task4Data = [
    { 摘要:'俄方回应美德向乌提供主战坦克：是“荒谬的主意”',内容: '针对美国将向乌提供31辆主战坦克、德国决定向乌克兰提供主战坦克，俄罗斯总统新闻秘书佩斯科夫25日说，美德向乌克兰提供主战坦克是“荒谬的主意”。俄驻德大使涅恰耶夫表示，这将进一步加剧俄乌冲突，并与德国领导人关于德国不想卷入冲突的声明矛盾。（总台记者宋瑶 余鹏）',文本向量相似度: '1' },
    { 摘要:'以色列考虑向乌克兰提供“铁穹”防御系统',内容: '美国在中东的盟友以色列此前一直没有松口同意向乌克兰输送武器，但以色列媒体曾报道说，迫于美国的不断施压，以色列不得不开始向乌克兰提供武器。以色列总理内塔尼亚胡1月31日在接受美国有线电视新闻网专访时称，“铁穹”防御系统在考虑范围内。以色列总理 内塔尼亚胡：我确实正在考虑提供“铁穹”。此外，内塔尼亚胡说，美国已将之前存放在以色列的大部分弹药运到了乌克兰，他同时强调，这是美方的决定。以色列总理 内塔尼亚胡：以色列只有25万枚弹药可供预先部署，已被美国拿走了，这是美国的决定。这样可以，我对此没有问题。事实上，我们没有提出任何异议，这不是我们的决定。但这是人们必须理解的一点，我的意思是，美国从以色列拿走了大量军火，转移给了乌克兰。俄外交部：所有武器都是合法打击目标对此，俄罗斯外交部发言人扎哈罗娃2月1日向以色列发出警告。俄外交部发言人 扎哈罗娃：我们不会用地理来区分国家，我们要表达的是，所有向乌克兰提供武器的国家应该明白，所有这些武器都将成为俄罗斯武装力量的合法打击目标',文本向量相似度: '0.86'},
    { 摘要:'是否为乌克兰提供“爱国者”，美国有点左右为难',内容: '中新网12月1日电 日前，有美国高级官员向媒体透露，美国正在考虑向乌克兰提供“爱国者”防空导弹系统，但美国国防部随后“官方辟谣”，称目前还没有这一计划。 一直大力向乌克兰提供军援，“拱火”不断的美国，却在是否向乌克兰提供“爱国者”防空导弹一事上，显得有些左右为难。 乌方讨要  自俄乌局势恶化以来，乌克兰一直向美国要求各类武器装备援助，“爱国者”防空导弹系统更是乌克兰最想获得的军援之一。 入冬后，乌总统泽连斯基多次表示，乌克兰多地处于断电状态，要求西方提供“爱国者”防空导弹。 乌外长库列巴11月17日与美国务卿布林肯通话后，也在社交媒体上发文强调，在乌克兰基础设施受到打击大面积断电之际，美国应该加快向乌提供防空系统的速度， “现在是提供‘爱国者’防空系统的时候了”。 “爱国者”防空导弹是美国研制的第三代中远程、中高空地空导弹系统，分为3个型号，其中“爱国者-3”最为先进，是美军的代表性武器之一。据CNN介绍，“爱国者”可以用来对抗并摧毁来袭的短程弹道导弹、先进飞机及巡航导弹。 美国媒体11月29日援引美国国防部一名高级官员的消息报道称，美国正在考虑直接向乌克兰提供“爱国者”导弹系统。这名官员还表示，乌克兰的防空是美国的“头等大事”。 俄方警告  美国可能提供“爱国者”的消息一出，马上引起俄方的强烈不满。 俄罗斯国家安全会议副主席梅德韦杰夫随即回应称，如果北约向乌克兰提供“爱国者”导弹系统和工作人员，那他们将立刻成为俄罗斯武装部队的合法目标。 俄罗斯副外长里亚布科夫也表示，美国进一步干涉俄乌局势而导致严重后果的风险正在增加。 接着，美国国防部新闻秘书莱德澄清，美国目前没有计划对乌克兰提供“爱国者”防空系统。 莱德称，防空仍是美国防部和国际社会支持乌克兰的首要任务，“至于不同型号的‘爱国者’导弹系统，目前我们没有对乌克兰提供该导弹系统的计划。但我们将继续进行这类讨论。” 莱德还称，美国将继续与国际社会密切合作了解乌克兰的国防需求，并确保其获得满足。 美国为难  美国参谋长联席会议主席马克·米利曾表示，美国将继续尽可能多地、以最好的可用装备支持乌克兰，“只要(乌克兰)需要，将继续一路支持下去”。 但是在提供“爱国者”防空导弹的问题上，美国却犹犹豫豫，措辞前后矛盾。 一方面，美国对俄方的警告也心存顾虑，担心诱发局势出现巨大升级。 美联社称，提供“爱国者”导弹意味着西方在援助乌克兰方面取得巨大进展。但谈论这一话题就“已经激怒了莫斯科”。 另一方面，俄罗斯外交部发言人扎哈罗娃此前曾表示，美国可能受到了乌克兰的“敲诈”。 扎哈罗娃称，在西方遭遇困难的情况下，乌克兰仍在要求西方提供更多的援助，提供天文数字的资金和武器，乌克兰总统泽连斯基已经进入“自己的轨道”，开始敲诈西方。 她表示，“这种情况经常发生在西方积极培养的亲信身上，随着时间推移，他们会开始提出自己的条件。”',文本向量相似度: '0.82'},
    { 摘要:'白宫方面证实：首批“艾布拉姆斯”坦克抵乌 未来交付更多',内容: '美国白宫国家安全委员会战略沟通协调员约翰·柯比当地时间25日证实，第一批美国“艾布拉姆斯”坦克已运抵乌克兰，未来几周内，美国将向乌克兰交付新一批坦克。当天，乌克兰总统泽连斯基也在社交媒体上发文说，美国的“艾布拉姆斯”主战坦克已经运抵乌克兰。俄罗斯此前已就向乌克兰供应武器问题向包括美国在内的各国发出照会。俄方多次表示，美西方持续向乌克兰提供军事支持是“火上浇油”，无益于解决俄乌冲突。俄外长拉夫罗夫指出，任何包含供乌武器的物资都将成为俄罗斯的合法打击目标。',文本向量相似度: '0.81'},
    { 摘要:'泽连斯基：太难了，我们需要更快地获得更多武器!',内容: '中新网1月30日电 据路透社报道，当地时间29日，乌克兰总统泽连斯基表示，乌克兰需要更多新武器和更快的武器交付速度，以应对俄军在顿涅茨克东部地区不断发动袭击造成的“异常艰难”局面。 据报道，在当天夜间视频讲话中，泽连斯基称“形势非常严峻。在巴赫穆特、维勒达及顿涅茨克东部的其他地区——俄罗斯不断发动袭击，试图突破我们的防御。” “俄罗斯希望拖延并耗尽我们的力量。所以我们必须让时间成为武器。我们必须加快事态发展，加快援乌武器供应并开辟新的武器选择，”泽连斯基说道。 乌克兰武装部队总参谋部29日早些时候表示，其部队击退了顿涅茨克市西南约45公里处的布拉戈达特涅(Blahodatne)附近的一次袭击，而俄私人军事公司瓦格纳集团表示已控制该村庄。 泽连斯基28日曾呼吁，乌克兰需要射程约300公里的美国陆军战术导弹系统，但美国迄今为止拒绝提供这种武器。据乌克兰高官表示，目前乌正在与西方盟国就提供远程导弹和战斗机进行谈判。 近日，随着顿涅茨克地区局势的升级，泽连斯基在最近的讲话中表示，乌克兰指挥部致力于确保“我们对(俄)造成的压力大于(俄)的攻击能力”，这意味着“我们需要伙伴国保持军备防御支持”。 对此，俄罗斯外交部发言人扎哈罗娃曾回应称，援乌坦克会把西方与俄罗斯的对抗推向新高度。俄总统新闻秘书佩斯科夫也强调，美方试图借军事援助延长乌克兰危机。美国总统拜登掌握结束危机的钥匙却不愿使用，“相反，他选择向乌方提供更多武器的路径”',文本向量相似度: '0.79'},
];

export const chartDatas= [
    {
        // 图表的标题
        title: {
            text: '柱状图示例2'
        },
        // 图表的提示框组件
        tooltip: {
            trigger: 'axis'
        },
        // 图表的 x 轴配置
        xAxis: {
            type: 'category',
            data: ['周一', '周二', '周三', '周四', '周五', '周六', '周日']
        },
        // 图表的 y 轴配置
        yAxis: {
            type: 'value'
        },
        // 图表的系列配置，这里是柱状图
        series: [
            {
                name: '销量',
                type: 'bar',
                data: [120, 200, 150, 80, 70, 110, 130]
            }
        ]
    }
    // 可以继续添加更多的图表数据
];

export const plan = {
    ID:0,
    OPERATOR:"HASH JOIN",
    CHILD_1: {
        ID:1,
        OPERATOR:"HASH JOIN",
        CHILD_1: {
            ID:2,
            OPERATOR:"TABLE SCAN"
        },
        CHILD_2:{
            ID:3,
            OPERATOR:"TABLE SCAN"
        },
    },   
    CHILD_2:{
        ID:4,
        OPERATOR:"TABLE SCAN"
    },
};

export const opt_plan = {
    ID:0,
    OPERATOR:"PREDICT OP",
    pyudf_metadata: "([name: onnx_expedia])",
    CHILD_1: {
        ID:1,	
        OPERATOR:"HASH JOIN",
        CHILD_1: {
            ID:2,
            OPERATOR:"HASH JOIN",
            CHILD_1: {
                ID:3,
                OPERATOR:"TABLE SCAN"
            },
            CHILD_2: {
                ID:4,
                OPERATOR:"TABLE SCAN"
            },
        },   
        CHILD_2:{
            ID:5,
            OPERATOR:"TABLE SCAN"
        },
    },
};

export const naive_expression = {
    ID:0,
    OPERATOR:"GreaterAndEqual",
    CHILD_1: {
        ID:1,	
        OPERATOR:"add",
        CHILD_1: {
            ID:2,
            OPERATOR:"add",
            CHILD_1: {
                ID:3,
                OPERATOR:"model_lr"
            },
            CHILD_2: {
                ID:4,
                OPERATOR:"model_nb"
            },
        },   
        CHILD_2:{
            ID:5,
            OPERATOR:"model_sgd"
        },
    },
    CHILD_2: {
        ID:6,
        OPERATOR:"CONST",
    },
};

export const opt_expression = {
    ID:0,
    OPERATOR:"GreaterAndEqual",
    CHILD_1: {
        ID:1,	
        OPERATOR:"model_merged",
    },
    CHILD_2: {
        ID:2,
        OPERATOR:"CONST",
    },
};

export const function_code = {
    code: `import numpy as np
import pandas as pd
import onnxruntime as ort
from transformers import T5Tokenizer
tokenizer = T5Tokenizer.from_pretrained('/root/summary_onnx2/')
encoder_session = ort.InferenceSession('/root/summary_onnx2/encoder_model.onnx')
decoder_session = ort.InferenceSession('/root/summary_onnx2/decoder_model.onnx')
result_list=[]
input_list=args[0].tolist()
input_list = ['summarize: ' + text for text in input_list]
inputs = tokenizer(input_list, return_tensors='np', padding=True, truncation=True, max_length=512)
input_ids = inputs['input_ids']
attention_mask = inputs['attention_mask']
encoder_inputs = {
    'input_ids': input_ids,
    'attention_mask': attention_mask,
}
encoder_outputs = encoder_session.run(None, encoder_inputs)
encoder_hidden_states = encoder_outputs[0]
decoder_input_ids = np.zeros((input_ids.shape[0], 1), dtype=np.int64)
generated_ids = []
for _ in range(40):  
    decoder_inputs = {
        'input_ids': decoder_input_ids,
        'encoder_hidden_states': encoder_hidden_states,
        'encoder_attention_mask': attention_mask,  
    }
    decoder_outputs = decoder_session.run(None, decoder_inputs)
    next_token_logits = decoder_outputs[0][:, -1, :]
    next_token_id = np.argmax(next_token_logits, axis=-1)
    decoder_input_ids = np.concatenate([decoder_input_ids, next_token_id[:, None]], axis=-1)
    generated_ids.append(next_token_id)
    if np.all(next_token_id == tokenizer.eos_token_id):
        break
generated_ids = np.concatenate(generated_ids, axis=-1)
generated_texts = [tokenizer.decode(ids, skip_special_tokens=True) for ids in generated_ids]
list_num = len(input_list )
lists = [[] for _ in range(list_num)]
res = [[] for _ in range(list_num)]
count=0
while count<len(generated_texts):
    for i in range(list_num):
        lists[i].append(generated_texts[count])
        count=count+1
count=0
for list in lists:
    tmp=[elem for elem in list if elem not in ('', '</s>', '<pad>')]
    res[count]=''.join(elem for elem in tmp)
    count=count+1
result_array = np.array(res)
return result_array`,
    rewrite_code:`import numpy as np
import pandas as pd
import onnxruntime as ort
from transformers import T5Tokenizer
def __init__(self):
    tokenizer = T5Tokenizer.from_pretrained('/root/summary_onnx2/')
    encoder_session = ort.InferenceSession('/root/summary_onnx2/encoder_model.onnx')
    decoder_session = ort.InferenceSession('/root/summary_onnx2/decoder_model.onnx')
def __call__(self,data):
    result_list=[]
    input_list=args[0].tolist()
    input_list = ['summarize: ' + text for text in input_list]
    inputs = tokenizer(input_list, return_tensors='np', padding=True, truncation=True, max_length=512)
    input_ids = inputs['input_ids']
    attention_mask = inputs['attention_mask']
encoder_inputs = {
    'input_ids': input_ids,
    'attention_mask': attention_mask,
    }
    encoder_outputs = encoder_session.run(None, encoder_inputs)
    encoder_hidden_states = encoder_outputs[0]
    decoder_input_ids = np.zeros((input_ids.shape[0], 1), dtype=np.int64)
    generated_ids = []
    for _ in range(40):  
        decoder_inputs = {
            'input_ids': decoder_input_ids,
            'encoder_hidden_states': encoder_hidden_states,
            'encoder_attention_mask': attention_mask,  
        }
        decoder_outputs = decoder_session.run(None, decoder_inputs)
        next_token_logits = decoder_outputs[0][:, -1, :]
        next_token_id = np.argmax(next_token_logits, axis=-1)
        decoder_input_ids = np.concatenate([decoder_input_ids, next_token_id[:, None]], axis=-1)
        generated_ids.append(next_token_id)
        if np.all(next_token_id == tokenizer.eos_token_id):
            break
    generated_ids = np.concatenate(generated_ids, axis=-1)
    generated_texts = [tokenizer.decode(ids, skip_special_tokens=True) for ids in generated_ids]
    list_num = len(input_list )
    lists = [[] for _ in range(list_num)]
    res = [[] for _ in range(list_num)]
    count=0
    while count<len(generated_texts):
        for i in range(list_num):
            lists[i].append(generated_texts[count])
            count=count+1
    count=0
    for list in lists:
        tmp=[elem for elem in list if elem not in ('', '</s>', '<pad>')]
        res[count]=''.join(elem for elem in tmp)
        count=count+1
    result_array = np.array(res)
    return result_array`
}